# ImporterIFCUtils Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImporterIFCUtils Members
ImporterIFCUtils Class Methods See Also
---
The ImporterIFCUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateEmptyFamily | Creates an empty family of a given category. |
| GetLocalFileName | Get the local file name, including the path, corresponding to a linked IFC file. This will create a local copy of the IFC file if necessary. |

# See Also
ImporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace